app/views/lectures/_form.html.erb

    <%= f.label :course_id %> (select the course from the dropdown menu)<br>
    <%= f.collection_select :course_id, Course.all, :id, :name_code , {prompt: "select course"}, {:class => "js-example-basic-single"} %>
---
SELECT "courses".* FROM "courses"

    <%= f.label :instructor_id %><br>
    <%= f.collection_select :instructor_id, Instructor.all, :id, :full_name, {prompt: "select Instructor"}, {:class => "js-example-basic-single"} %>
---
SELECT "instructors".* FROM "instructors"

    <%= f.label :term_id %> (select the term from the dropdown menu) <br>
    <%= f.collection_select :term_id, Term.all, :id, :term_formatted, {prompt: "Select term"}, {:class => "js-example-basic-single"} %>
---
SELECT "terms".* FROM "terms"