app/views/lectures/index.html.erb

        <td>
        <% if !lecture.lecture_files.first.nil? %>
---
SELECT  "lecture_files".* FROM "lecture_files" WHERE "lecture_files"."lecture_id" = ?  ORDER BY "lecture_files"."id" ASC LIMIT 1  [["lecture_id", 10]]
SELECT "lectures".* FROM "lectures"

        </td>
        <td><%= link_to lecture.user.first_name, user_path(lecture.user.id) %></td>
        <td><%= lecture.course.course_code %> <%= lecture.course.course_name%></td>
        <td><%= lecture.instructor.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 0]]

          <% n = 0 %>
          <% lecture.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."lecture_id" = ?  [["lecture_id", 10]]