app/views/lectures/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
  <strong>Shared by:</strong>
  <%=link_to @lecture.user.first_name, user_path(@lecture.user.id) %><br>

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 0]]
---
  <strong>Instructor:</strong>
  <%= @lecture.instructor.first_name %> <%= @lecture.instructor.last_name %>

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."lecture_id" = ? AND "reviews"."lecture_id" = ? LIMIT 1  [["lecture_id", 12], ["lecture_id", 12]]
---
  <% n = 0 %>
  <% @lecture.reviews.each do |review| %>

SELECT  "lecture_files".* FROM "lecture_files" WHERE "lecture_files"."lecture_id" = ?  ORDER BY "lecture_files"."id" ASC LIMIT 1  [["lecture_id", 9]]
---

<% if @lecture.lecture_files.first != nil %>

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  ORDER BY "reviews"."id" ASC LIMIT 1  [["user_id", 1]]
---
  <% logger.debug "the boolean value #{@lecture.reviews.find_by(lecture_id: @lecture.id ) != nil && params[:edited] != '1' }" %>
  <% if (@lecture.reviews.find_by(lecture_id: @lecture.id ) == nil || params[:edited]) && (@lecture.user != current_user)  %>