app/views/users/show.html.erb

  <tbody>
    <% @user.lectures.each do |lecture| %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."user_id" = ?  [["user_id", 1]]

        <td>
        <% if !lecture.lecture_files.first.nil? %>
---
SELECT  "lecture_files".* FROM "lecture_files" WHERE "lecture_files"."lecture_id" = ?  ORDER BY "lecture_files"."id" ASC LIMIT 1  [["lecture_id", 12]]

        <td><%= lecture.course.course_name%></td>
        <td><%= lecture.instructor.first_name %></td>
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]

          <% n = 0 %>
          <% lecture.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."lecture_id" = ?  [["lecture_id", 12]]