app/controllers/lectures_controller.rb

  def index
    @lectures = Lecture.all
---
SELECT "lectures".* FROM "lectures"

  def create
    @lecture = Lecture.new(lecture_params)
    @lecture.user = current_user
    respond_to do |format|
      if @lecture.save
        if !params[:lecture_files].nil?
          params[:lecture_files].each {|file|
            @lecture.lecture_files.create(image: file, user_id: current_user.id)
---
INSERT INTO "lectures" ("course_id", "instructor_id", "term_id", "lecture_name", "chapter", "description", "file_file_name", "file_content_type", "file_file_size", "file_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "lecture_files" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "lecture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @lecture.update(lecture_params)
        if !params[:lecture_files].nil?
          params[:lecture_files].each {|file|
            @lecture.lecture_files.create(image: file, user_id: current_user.id)
---
UPDATE "lectures" SET "lecture_name" = ?, "chapter" = ?, "description" = ?, "updated_at" = ? WHERE "lectures"."id" = ?  [["lecture_name", "Intro to Programming"], ["chapter", "Last Lecture: Hello Java"], ["description", "introduction to java"], ["updated_at", "2016-04-16 17:08:55.400601"], ["id", 9]]
INSERT INTO "lecture_files" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "lecture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    LectureFile.destroy_all(id: @lecture.lecture_files)
---
DELETE FROM "lecture_files" WHERE "lecture_files"."id" = ?  [["id", 1]]
DELETE FROM "lectures" WHERE "lectures"."id" = ?  [["id", 2]]

    def set_lecture
      @lecture = Lecture.find(params[:id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 3]]