app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("lecture_id", "user_id", "content", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["lecture_id", 11], ["user_id", 1], ["content", "This is not bad lol "], ["rating", 3], ["created_at", "2016-04-18 07:48:48.891753"], ["updated_at", "2016-04-18 07:48:48.891753"]]

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "content" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["content", "Life is good by lg let me give some rating yeh!!!"], ["rating", 4], ["updated_at", "2016-04-18 08:20:16.695937"], ["id", 21]]

  def destroy
    @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 18]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 21]]